app/views/cart/calculateDiscount.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
---
								<% @cart.each do | id, quantity | %>
								<% item = Item.find_by_id(id) %>