app/controllers/cart_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("order_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["order_date", "2015-11-25 23:03:07.202502"], ["user_id", 1], ["created_at", "2015-11-25 23:03:07.239762"], ["updated_at", "2015-11-25 23:03:07.239762"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orderitems" ("item_id", "title", "description", "quantity", "price", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def createOrder
		if user_signed_in? then
			# Step 1: Get the current user
			@user = User.find(current_user.id)
			# Step 2: Create a new order and associate it with the current user
			@order = @user.orders.build(:order_date => DateTime.now)
			@order.save
			# Step 3: For each item in the cart, create a new item on the order!!
			@cart = session[:cart] || {} # Get the content of the Cart
			@cart.each do | id, quantity |
				item = Item.find_by_id(id)
				@orderitem = @order.orderitems.build(:item_id => item.id, :title => item.title, :description => 				item.description, :quantity => quantity, :price => item.price)
				@orderitem.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
---
	def calculateDiscount
		if session[:cart] then
			@cart = session[:cart]
		else
			@cart = {}
		end
		@category = params[:search_category]
 		total = 0
		@cart.each do | id, quantity |
		  item = Item.find_by_id(id)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
---
	def currencyConvert
		if session[:cart] then
			@cart = session[:cart]
		else
			@cart = {}
		end
		@category = params[:currency_id]
 		total = 0
		@cart.each do | id, quantity |
		  item = Item.find_by_id(id)