app/controllers/items_controller.rb

  def searchProduct
    	#@items = Item.all
	search = "%" + params[:search_product] + "%"
	@items = Item.where("items.title LIKE ?", search)
---
SELECT "items".* FROM "items" WHERE (items.title LIKE '%Fancy Collection%')

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "description", "price", "image_url", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "image_url" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_url", "/assets/1.jpg"], ["updated_at", "2015-11-21 13:03:13.423637"], ["id", 1]]